<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","backend":"58285b80cfcf0633b9b7d08c3bc00271361ca0b42019afa0c9ee7631f83d8e22","plan_job_ref":"Job Create terraform plan on Pull Request #9 at https://github.com/markwcodes/personal-website-infra/actions/runs/6683111522","plan_hash":"3f82f61c4777f5d6f10a3d64ded4f928056fb3acc2b4d9d72636294c77aef5b6","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __terraform__ in the __staging__ workspace
With var files: `terraform/terraform.tfvars`
With variables: `do_token = (sensitive value)`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_certificate.primary_domain_cert will be created
  + resource "digitalocean_certificate" "primary_domain_cert" {
      + domains          = [
          + "staging.wilson.codes",
        ]
      + id               = (known after apply)
      + name             = "staging-staging.wilson.codes"
      + not_after        = (known after apply)
      + sha1_fingerprint = (known after apply)
      + state            = (known after apply)
      + type             = "lets_encrypt"
      + uuid             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Apply Terraform plan from Pull Request #2](https://github.com/markwcodes/personal-website-infra/actions/runs/6683114191)